[
  {
    "id": "python-budget-tracker",
    "title": "Python: Personal Budget Tracker (CLI)",
    "level": "Beginner",
    "tags": ["Python", "CLI", "CSV"],
    "summary": "A command-line tool to record expenses, categorise spending, and export data for review.",
    "situation": "Managing daily expenses without structure makes it difficult to track spending patterns.",
    "task": "Create a simple, reliable tool to record expenses quickly and store them in a reusable format.",
    "action": [
      "Designed a menu-driven CLI for fast data entry",
      "Implemented input validation to prevent incorrect data",
      "Stored records in CSV format for easy analysis later"
    ],
    "result": "The tool allows consistent expense tracking and produces clean data that can be analysed or visualised later.",
    "learnings": [
      "How to structure a Python program using small, reusable functions",
      "Why validating user input is critical even in simple programs",
      "How CSV files can act as a lightweight data storage format"
    ],
    "tech": ["Python", "CSV", "Functions", "Input validation"],
    "github": "https://github.com/Hemkiyo/hemaraj-portfolio/tree/main/repos/python-budget-tracker-cli"
  },
  {
    "id": "java-grade-calculator",
    "title": "Java: Student Grade Calculator",
    "level": "Beginner",
    "tags": ["Java", "CLI", "Fundamentals"],
    "summary": "A console application that calculates grades from marks using clear validation and control flow.",
    "situation": "Manual grade calculation can be inconsistent and error-prone.",
    "task": "Build a Java program that reliably converts marks into grade categories.",
    "action": [
      "Used loops and conditionals to process multiple inputs",
      "Applied input validation to handle incorrect values",
      "Structured logic into clear, readable methods"
    ],
    "result": "The program produces consistent results and can be extended for multiple students.",
    "learnings": [
      "How Java control flow differs from Python",
      "Why method structure improves readability and maintenance",
      "How to think in terms of logic flow before writing code"
    ],
    "tech": ["Java", "Loops", "Conditionals", "Methods"],
    "github": "https://github.com/Hemkiyo/hemaraj-portfolio/tree/main/repos/java-grade-calculator"
  },
  {
    "id": "file-organiser",
    "title": "Automation: Downloads Folder File Organiser",
    "level": "Beginner",
    "tags": ["Python", "Automation", "OS"],
    "summary": "A Python automation script that organises files by type with safety checks.",
    "situation": "Downloads folders quickly become cluttered and hard to manage.",
    "task": "Automate file organisation while avoiding accidental data loss.",
    "action": [
      "Scanned files using pathlib and OS utilities",
      "Implemented a dry-run mode before moving files",
      "Added logging for traceability and debugging"
    ],
    "result": "The script keeps folders organised safely and can be reused or extended easily.",
    "learnings": [
      "How automation scripts can save time in everyday workflows",
      "Why safety checks are important when working with file systems",
      "How logging helps debug and trust automation code"
    ],
    "tech": ["Python", "os/pathlib", "Logging"],
    "github": "https://github.com/Hemkiyo/hemaraj-portfolio/tree/main/repos/downloads-file-organiser"
  }
]
